src/Documents/ЗаявкаФСВТС/ЗаявкаФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаФСВТС</name>
  <registerRecords>AccumulationRegister.ЗаявкиФСВТС</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодачиТКП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проекты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Корабли</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.Заказы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>КодПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбозначениеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаявкаФСВТС/Forms/ФормаДокумента/Module.bsl
/////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработчикВыбораИзделия(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если Результат = Неопределено Тогда 	
	ТекущаяСтрока							= Элементы.ПредметыСнабжения.ТекущиеДанные;
	ТекущаяСтрока.Изделие					= Результат.Изделие;
	ТекущаяСтрока.ОписаниеИерархииИзделия 	= Результат.Описание;	
КонецПроцедуры // ОбработчикВыбораИзделия()

&НаСервере
Функция ПолучитьСписокВыбораПредметовСнабжения(Обозначение)
	Возврат Справочники.КаталогПредметовСнабжения.ПолучитьСписокПодобных(Обозначение);
КонецФункции // ПолучитьСписокВыбора

&НаСервере
Функция ПолучитьСписокВыбораИзделий(ПредметСнабжения)
	Возврат Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПолучитьСписок(ПредметСнабжения, Объект.Корабли.Выгрузить().ВыгрузитьКолонку("Корабль"));
КонецФункции // ПолучитьСписокВыбораИзделий

Функция ПолучитьОписаниеИзделия(Изделие)
	Возврат РегистрыСведений.ОписанияИерархииЭлементовСтруктурыЗаказовПоКомплектующимИзделиямИЗИП.ПолучитьОписание(Изделие);
КонецФункции // ПолучитьОписаниеИзделия

&НаСервере
Функция ПолучитьСтруктуруИзделия(ПредметСнабжения)
	Возврат Справочники.СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПолучитьИзделие(
													ПредметСнабжения,
													Объект.Корабли.Выгрузить().ВыгрузитьКолонку("Корабль"));
КонецФункции // ПолучитьСтруктуруИзделия

&НаСервере
Функция ПолучитьМассивКораблей()
	ТаблицаКораблей = Объект.Корабли.Выгрузить();
	ТаблицаКораблей.Свернуть("Корабль");
	Возврат ТаблицаКораблей.ВыгрузитьКолонку("Корабль");
КонецФункции // ПолучитьМассивКораблей

&НаСервере
Процедура ЗагрузитьПредметыСнабжения(АдресВХранилище) 
	Объект.ПредметыСнабжения.Загрузить(ПолучитьИзВременногоХранилища(АдресВХранилище));
КонецПроцедуры // ЗагрузитьПредметыСнабжения

&НаКлиенте
Процедура ПослеЗагрузиПредметовСнабжения(АдресВХранилище, ДополнительныеПараметры) Экспорт
	Если АдресВХранилище = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если АдресВХранилище = Неопределено Тогда	
	ЗагрузитьПредметыСнабжения(АдресВХранилище);
КонецПроцедуры // ПослеЗагрузиПредметовСнабжения

&НаСервере
Процедура СтартоватьБизнесПроцессРаспределенияЗаявки()
	Если БизнесПроцессы.РаспределениеЗаявкиФСВТС.СуществуютПроцессыПоЗявке(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По заявке уже существует бизнес процесс.");
		Возврат;
	КонецЕсли; // Если БизнесПроцессы.РаспределениеЗаявкиФСВТС.СуществуютПроцессыПоЗявке(Объект.Ссылка) Тогда
	
	БизнесПроцесс =	БизнесПроцессы.РаспределениеЗаявкиФСВТС.Создать(Объект.Ссылка);
КонецПроцедуры // СтартоватьБизнесПроцессРаспределенияЗаявки

/////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаЗагрузитьИзExcel(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Корабли", ПолучитьМассивКораблей());
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ПослеЗагрузиПредметовСнабжения", ЭтаФорма);
	ОткрытьФорму("Документ.ЗаявкаФСВТС.Форма.ФормаЗагрузкиИзExcel",
					СтруктураПараметров, 
					ЭтаФорма, 
					ЭтаФорма.УникальныйИдентификатор,,,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры // КомандаЗагрузитьИзExcel

&НаКлиенте
Процедура КомандаЗапуститьБизнесПроцессРаспределенияЗаявки(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) 
		Или Модифицированность 
		Или Не Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Необходимо сначала провести документ", 60, "Внимание");
		Возврат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
	СтартоватьБизнесПроцессРаспределенияЗаявки();
КонецПроцедуры // КомандаЗапуститьБизнесПроцессРаспределенияЗаявки


/////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура КораблиКорабльАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Отбор.Вставить("Заказчик", Объект.Заказчик);
КонецПроцедуры // КораблиКорабльАвтоПодбор

&НаКлиенте
Процедура ПредметыСнабженияПредметСнабженияПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПредметыСнабжения.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ТекущаяСтрока = Неопределено Тогда
	
	
	СтруктураИзделия 			= ПолучитьСтруктуруИзделия(ТекущаяСтрока.ПредметСнабжения);
	Если СтруктураИзделия = Неопределено Тогда
		ТекущаяСтрока.Изделие 					= "";
		ТекущаяСтрока.ОписаниеИерархииИзделия 	= "";
	Иначе
		ТекущаяСтрока.Изделие		 			= СтруктураИзделия.Изделие;
		ТекущаяСтрока.ОписаниеИерархииИзделия 	= СтруктураИзделия.Описание;
	КонецЕсли; // Если Не СтруктураИзделия = Неопределено Тогда
КонецПроцедуры // ПредметыСнабженияПредметСнабженияПриИзменении

&НаКлиенте
Процедура ПредметыСнабженияПредметСнабженияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание = 0 Тогда
		ТекущаяСтрока 				= Элементы.ПредметыСнабжения.ТекущиеДанные;
		СписокВыбора 				= ПолучитьСписокВыбораПредметовСнабжения(ТекущаяСтрока.ОбозначениеПС);
		Если СписокВыбора.Количество() > 0 Тогда
			СтандартнаяОбработка 	= Ложь;
			ДанныеВыбора 			= СписокВыбора;		
		КонецЕсли; // Если СписокВыбора.Количество() > 0 Тогда
	КонецЕсли; // Если Ожидание = 0 Тогда 	              
КонецПроцедуры // ПредметыСнабженияПредметСнабженияАвтоПодбор

&НаКлиенте
Процедура ПредметыСнабженияИзделиеПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПредметыСнабжения.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ТекущаяСтрока = Неопределено Тогда
	
	ТекущаяСтрока.ОписаниеИерархииИзделия = ПолучитьОписаниеИзделия(ТекущаяСтрока.Изделие);
КонецПроцедуры // ПредметыСнабженияИзделиеПриИзменении

&НаКлиенте
Процедура ПредметыСнабженияИзделиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;	
	ПредметСнабжения 		= Элементы.ПредметыСнабжения.ТекущиеДанные.ПредметСнабжения;	
	Если Не ЗначениеЗаполнено(ПредметСнабжения) Тогда                               	
		ПоказатьПредупреждение(, "Не заполнен предмет снабжения",, 
									"Действие запрещено");
		Возврат;                                          	
	КонецЕсли; // Если Не ЗначениеЗаполнено(ПредметСнабжения) Тогда
	
	ПараметрыОткрытия 		= Новый Структура("ПредметСнабжения", ПредметСнабжения);      	
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ОбработчикВыбораИзделия", ЭтаФорма);	
	ОткрытьФорму("Документ.Заявка.Форма.ФормаПодбораИзделия", 
							ПараметрыОткрытия, 
							ЭтотОбъект,,,, 
							ОписаниеОповещения, 
							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры // ПредметыСнабженияИзделиеНачалоВыбора 

&НаКлиенте
Процедура ПредметыСнабженияИзделиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание = 0 Тогда
		ТекущаяСтрока 				= Элементы.ПредметыСнабжения.ТекущиеДанные;
		СписокВыбора 				= ПолучитьСписокВыбораИзделий(ТекущаяСтрока.ПредметСнабжения);
		Если СписокВыбора.Количество() > 0 Тогда
			СтандартнаяОбработка 	= Ложь;
			ДанныеВыбора 			= СписокВыбора;		
		КонецЕсли; // Если СписокВыбора.Количество() > 0 Тогда
	КонецЕсли; // Если Ожидание = 0 Тогда
КонецПроцедуры // ПредметыСнабженияИзделиеАвтоПодбор

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БизнесПроцесс = БизнесПроцессы.РаспределениеЗаявкиФСВТС.ПолучитьБизнесПроцесс(Объект.Ссылка);
КонецПроцедуры // ПриСозданииНаСервере
